todo_project/TodoProject/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    todos = Todo.all

INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdasd"], ["body", "asdasdasd"], ["done", true], ["created_at", "2022-04-14 21:22:17.627864"], ["updated_at", "2022-04-14 21:22:17.627864"]]
---
  def create
    todo = Todo.new(todo_params)

    if todo.save